In [10]:
import math

In [1]:
import pandas as pd
score = {
    '학년':[1,1,1,1,2,2],
    '반':['A', 'A', 'B', 'B', 'C', 'C'],
    '성별': ['F', 'M', 'F', 'M', 'F', 'M'],
    '성적': [76, 88, 85, 72, 68, 70]
         }
score = pd.DataFrame(score)

In [2]:
score

   학년  반 성별  성적
0   1  A  F  76
1   1  A  M  88
2   1  B  F  85
3   1  B  M  72
4   2  C  F  68
5   2  C  M  70

In [3]:
score = score.pivot_table(index=['학년', '반'], columns='성별', values='성적')

In [4]:
score

성별       F     M
학년 반
1  A  76.0  88.0
   B  85.0  72.0
2  C  68.0  70.0

In [5]:
score.reset_index().melt(id_vars=['학년', '반'], value_name='성적', var_name='성별')

   학년  반 성별    성적
0   1  A  F  76.0
1   1  B  F  85.0
2   2  C  F  68.0
3   1  A  M  88.0
4   1  B  M  72.0
5   2  C  M  70.0

In [6]:
import numpy as np
score.apply(np.sqrt, axis=0)

성별           F         M
학년 반
1  A  8.717798  9.380832
   B  9.219544  8.485281
2  C  8.246211  8.366600

In [7]:
score.apply(np.max, axis=0)

성별
F    85.0
M    88.0
dtype: float64

In [8]:
pf = lambda x: x+5
score.apply(pf)

성별       F     M
학년 반
1  A  81.0  93.0
   B  90.0  77.0
2  C  73.0  75.0

In [12]:
class_avg = lambda df: math.ceil((df['F'] + df['M'])/2)
score.apply(class_avg, axis=1)

학년  반
1   A    82
    B    79
2   C    69
dtype: int64

In [13]:
score['M'].map(pf)

학년  반
1   A    93.0
    B    77.0
2   C    75.0
Name: M, dtype: float64